Autodesk.Revit.DB.Element.DisplayLockOnlyWhenElementIsSelected(Autodesk.Revit.DB.View)
In some cases, the current selection set is augmented and locks are displayed for the additional elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Element.GetExternalResourceReference(Autodesk.Revit.DB.ExternalResourceType)
Gets the ExternalResourceReference associated with a specified external resource type.
resourceType:
The desired external resource type.
Returns:
The copy of the ExternalResourceReference associated with a specified external resource type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This Element does not use a resource reference for the specified resource type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Element.DeleteSubelements(System.Collections.Generic.IList{Autodesk.Revit.DB.Subelement})
Removes the subelements from the element.
Remarks:
Depending on implementation for given element as the result, the element
can be deleted - especially if after Subelement deletion there are no Subelement left.
subelems:
Subelements to delete.
Returns:
True if entire element was deleted, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more subelements in subelems do not exist in the element.
-or-
One or more of the subelements subelems cannot be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
This Element is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this Element is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This Element is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Since:
2018

Autodesk.Revit.DB.Element.DeleteSubelement(Autodesk.Revit.DB.Subelement)
Removes a subelement from the element.
Remarks:
Depending on implementation for given element as the result, the element
can be deleted - especially if after subelement deletion there are no subelements left.
subelem:
The subelement to delete.
Returns:
True if entire element was deleted, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The subelement subelem does not exist in the element.
-or-
Subelement subelem cannot be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
This Element is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this Element is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This Element is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Since:
2018

Autodesk.Revit.DB.Element.ChangeTypeId(Autodesk.Revit.DB.ElementId)
Changes the type of the element.
Remarks:
In rare cases, applying a change in type will result in a new element being created.
The only active examples of this are when applying a normal wall type to a curtain panel, or
converting such a wall back to a curtain panel.
In this situation the new element id is returned.
Also, this element becomes invalid.
typeId:
Identifier of the type to assign to this element.
Returns:
The new element id if new element is created, or InvalidElementId if the element's type changed without creating a new element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The type typeId is not valid for this element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Element cannot have type assigned.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
This Element is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this Element is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This Element is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Since:
2011